In [115]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime 
import ast
import json

In [116]:
pd.set_option('display.max_colwidth', None)

In [117]:
dfgenres= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Genres.csv')
dfgenres.head()

,id,genres
0,862,"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': 10751, 'name': 'Family'}]"
1,8844,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, 'name': 'Fantasy'}, {'id': 10751, 'name': 'Family'}]"
2,15602,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, 'name': 'Comedy'}]"
3,31357,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}, {'id': 10749, 'name': 'Romance'}]"
4,11862,"[{'id': 35, 'name': 'Comedy'}]"

In [120]:
dfgenres.shape

(45466, 2)

In [121]:
dfgenres.sort_values(by='id', ascending=False)

,id,genres
13106,9999,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name': 'Drama'}]"
25079,99977,"[{'id': 35, 'name': 'Comedy'}]"
12549,9997,"[{'id': 14, 'name': 'Fantasy'}, {'id': 27, 'name': 'Horror'}, {'id': 28, 'name': 'Action'}, {'id': 878, 'name': 'Science Fiction'}]"
3767,9995,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'name': 'Crime'}, {'id': 18, 'name': 'Drama'}]"
25652,99946,"[{'id': 35, 'name': 'Comedy'}]"
...,...,...
36946,100017,"[{'id': 18, 'name': 'Drama'}]"
17451,100010,"[{'id': 18, 'name': 'Drama'}, {'id': 10752, 'name': 'War'}]"
4435,10001,"[{'id': 35, 'name': 'Comedy'}, {'id': 878, 'name': 'Science Fiction'}]"
13609,10000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}]"
2429,100,"[{'id': 35, 'name': 'Comedy'}, {'id': 80, 'name': 'Crime'}]"

In [122]:
dfgenres['genres'] = dfgenres['genres'].apply(ast.literal_eval)

In [124]:
df_exploded = dfgenres.explode('genres', ignore_index=True) 
df_exploded.head()

     id                           genres
0   862  {'id': 16, 'name': 'Animation'}
1   862     {'id': 35, 'name': 'Comedy'}
2   862  {'id': 10751, 'name': 'Family'}
3  8844  {'id': 12, 'name': 'Adventure'}
4  8844    {'id': 14, 'name': 'Fantasy'}

In [125]:
df_exploded['name_genres'] = df_exploded['genres'].apply(lambda x: x.get('name', '') if isinstance(x, dict) else '')
df_exploded['id_genres'] = df_exploded['genres'].apply(lambda x: x.get('id', '') if isinstance(x, dict) else '')

In [126]:
df_exploded.head()

     id                           genres name_genres id_genres
0   862  {'id': 16, 'name': 'Animation'}   Animation        16
1   862     {'id': 35, 'name': 'Comedy'}      Comedy        35
2   862  {'id': 10751, 'name': 'Family'}      Family     10751
3  8844  {'id': 12, 'name': 'Adventure'}   Adventure        12
4  8844    {'id': 14, 'name': 'Fantasy'}     Fantasy        14

In [127]:
df_exploded.drop(columns='genres')

           id name_genres id_genres
0         862   Animation        16
1         862      Comedy        35
2         862      Family     10751
3        8844   Adventure        12
4        8844     Fantasy        14
...       ...         ...       ...
93543   67758      Action        28
93544   67758       Drama        18
93545   67758    Thriller        53
93546  227506
93547  461257

[93548 rows x 3 columns]

In [129]:
grouped_df = df_exploded.groupby('id').agg({'name_genres': lambda x: "'" + "' '".join(x) + "'",
                                           'id_genres': lambda x: "'" + ','.join(map(str, x)) + "'"}).reset_index()

grouped_df

           id                                    name_genres       id_genres
0         100                               'Comedy' 'Crime'         '35,80'
1       10000                               'Comedy' 'Drama'         '35,18'
2       10001                     'Comedy' 'Science Fiction'        '35,878'
3      100010                                  'Drama' 'War'      '18,10752'
4      100017                                        'Drama'            '18'
...       ...                                            ...             ...
45431   99946                                       'Comedy'            '35'
45432    9995                       'Action' 'Crime' 'Drama'      '28,80,18'
45433    9997  'Fantasy' 'Horror' 'Action' 'Science Fiction'  '14,27,28,878'
45434   99977                                       'Comedy'            '35'
45435    9999                                'Crime' 'Drama'         '80,18'

[45436 rows x 3 columns]

In [110]:
grouped_df.sort_values(by='id', ascending=False)

           id                                    name_genres       id_genres
45435    9999                                'Crime' 'Drama'         '80,18'
45434   99977                                       'Comedy'            '35'
45433    9997  'Fantasy' 'Horror' 'Action' 'Science Fiction'  '14,27,28,878'
45432    9995                       'Action' 'Crime' 'Drama'      '28,80,18'
45431   99946                                       'Comedy'            '35'
...       ...                                            ...             ...
4      100017                                        'Drama'            '18'
3      100010                                  'Drama' 'War'      '18,10752'
2       10001                     'Comedy' 'Science Fiction'        '35,878'
1       10000                               'Comedy' 'Drama'         '35,18'
0         100                               'Comedy' 'Crime'         '35,80'

[45436 rows x 3 columns]

In [130]:
hola2= grouped_df[grouped_df['id']== '862']
hola2

        id                    name_genres      id_genres
42817  862  'Animation' 'Comedy' 'Family'  '16,35,10751'

In [131]:
grouped_df['id'].unique()

array(['100', '10000', '10001', ..., '9997', '99977', '9999'],
      dtype=object)

In [132]:
df_exploded['id'].unique()

array(['862', '8844', '15602', ..., '67758', '227506', '461257'],
      dtype=object)

In [133]:
## creo el CSV DE LOS GENEROS CON LOS IDS DE LAS PELICULAS
grouped_df.to_csv('GenerosFinalPORid.csv', index=False)